src/cf/InformationRegisters/bon_СостоянияНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>bon_СостоянияНоминальныхОбъектов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bon_СтатусыНоминальныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоминальныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.bon_НоминальныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/bon_СтатусыНоминальныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>bon_СтатусыНоминальныхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВведенВОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыведенИзОборота</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/bon_СостоянияНоминальныхОбъектов/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
	// проверка на запрет повторного ввода в оборот
	мОбъектыКПроверке = Новый Массив;
	
	Для каждого СтрокаЗаписи Из ЭтотОбъект Цикл
		
		Если СтрокаЗаписи.Статус = Перечисления.bon_СтатусыНоминальныхОбъектов.ВыведенИзОборота Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СтрокаЗаписи.НоминальныйОбъект.Владелец.НакапливаемыйНоминал ИЛИ СтрокаЗаписи.НоминальныйОбъект.Владелец.Многоразовый Тогда
			Продолжить;	
		КонецЕсли;
		
		мОбъектыКПроверке.Добавить(СтрокаЗаписи.НоминальныйОбъект); 
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	bon_СостоянияНоминальныхОбъектов.Номер КАК Номер,
		|	bon_СостоянияНоминальныхОбъектов.НоминальныйОбъект КАК НоминальныйОбъект
		|ИЗ
		|	РегистрСведений.bon_СостоянияНоминальныхОбъектов КАК bon_СостоянияНоминальныхОбъектов
		|ГДЕ
		|	bon_СостоянияНоминальныхОбъектов.Статус = &СтатусВводаВОборот
		|	И bon_СостоянияНоминальныхОбъектов.Номер В(&мОбъектыКПроверке)
		|	И bon_СостоянияНоминальныхОбъектов.НоминальныйОбъект В(&мОбъектыКПроверке)
		|	И bon_СостоянияНоминальныхОбъектов.Регистратор <> &ТекущийДокумент";

	Запрос.УстановитьПараметр("мОбъектыКПроверке", мОбъектыКПроверке);
	Запрос.УстановитьПараметр("СтатусВводаВОборот", Перечисления.bon_СтатусыНоминальныхОбъектов.ВведенВОборот);
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Отбор.Регистратор.Значение);

	РезультатПроверки = Запрос.Выполнить().Выбрать();

	Если РезультатПроверки.Количество() <> 0 Тогда
		Отказ = Истина;	
	КонецЕсли;  	
	
КонецПроцедуры
